cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "cargo-lambda/cargo-lambda"

brew "age"
brew "ansible"
brew "aqua"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cargo-chef"
brew "cargo-depgraph"
brew "cargo-lambda"
brew "cargo-make"
brew "cargo-nextest"
brew "cargo-zigbuild"
brew "cmake"
brew "datafusion"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "duckdb"
brew "duti"
brew "eza"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "graphviz"
brew "hexyl"
brew "htop"
brew "jj"
brew "jq"
brew "lima"
brew "llvm"
brew "mdbook"
brew "mingw-w64"
brew "mise"
brew "mise"
brew "mold"
brew "monolith"
brew "neovim"
brew "premake"
brew "radare2"
brew "ripgrep"
brew "sccache"
brew "shellcheck"
brew "sops"
brew "sops"
brew "starship"
brew "tig"
brew "tmux"
brew "tokei"
brew "trunk"
brew "wrkflw"
brew "xsv"
brew "zoxide"

cask "font-hack"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

cask "1password"
cask "alfred"
cask "alt-tab"
cask "discord"
cask "firefox"
cask "flux"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "homerow"
cask "inkscape"
cask "jetbrains-toolbox"
cask "kiro"
cask "licecap"
cask "neovide"
cask "notion"
cask "postman"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "vv"
cask "wezterm"
cask "zed"
cask "zoom"
