cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "bat"
brew "cargo-make"
brew "cmake"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "fish"
brew "git"
brew "hexyl"
brew "htop"
brew "jq"
brew "lima"
brew "mise"
brew "neovide"
brew "neovim"
brew "premake"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "tig"
brew "tmux"
brew "tokei"
brew "tree"
brew "zoxide"

cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

cask "1password"
cask "alfred"
cask "alt-tab"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "inkscape"
cask "jetbrains-toolbox"
cask "kitty"
cask "krita"
cask "notion"
cask "orbstack"
cask "postman"
cask "rectangle"
cask "skitch"
cask "slack"
cask "vimr"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
