cask_args appdir: "/Applications"

tap "homebrew/bundle"

brew "awscli"
brew "bat"
brew "cargo-make"
brew "cargo-zigbuild"
brew "cmake"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "duti"
brew "fish"
brew "eza"
brew "git"
brew "hexyl"
brew "htop"
brew "jq"
brew "lima"
brew "mise"
brew "mold"
brew "neovim"
brew "premake"
brew "ripgrep"
brew "mise"
brew "sccache"
brew "starship"
brew "tig"
brew "tmux"
brew "tokei"
brew "zoxide"

cask "font-hack"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"

cask "1password"
cask "alfred"
cask "alt-tab"
cask "discord"
cask "firefox"
cask "flux"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "inkscape"
cask "jetbrains-toolbox"
cask "neovide"
cask "notion"
cask "postman"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
cask "zoom"
